const tarotList = [
  "愚者", "魔术师", "女祭司", "皇后", "皇帝", "教皇", "恋人", "战车",
  "力量", "隐士", "命运之轮", "正义", "吊人", "死神", "节制",
  "恶魔", "高塔", "星星", "月亮", "太阳", "审判", "世界",

  "权杖Ace","权杖2","权杖3","权杖4","权杖5","权杖6",
  "权杖7","权杖8","权杖9","权杖10",
  "权杖侍从","权杖骑士","权杖皇后","权杖国王",

  "圣杯Ace","圣杯2","圣杯3","圣杯4","圣杯5","圣杯6","圣杯7",
  "圣杯8","圣杯9","圣杯10",
  "圣杯侍从","圣杯骑士","圣杯皇后","圣杯国王",

  "宝剑Ace","宝剑2","宝剑3","宝剑4","宝剑5","宝剑6","宝剑7",
  "宝剑8","宝剑9","宝剑10",
  "宝剑侍从","宝剑骑士","宝剑皇后","宝剑国王",

  "星币Ace","星币2","星币3","星币4","星币5","星币6","星币7",
  "星币8","星币9","星币10",
  "星币侍从","星币骑士","星币皇后","星币国王"
]


module.exports = {
  tarotList
};