export default {
  primaryColor: '#65bd1d',
  primaryColorLight: '#e6f4d9',
  primaryColorDark: '#4ca315',

  foodList: [
    { 
      label: '蔬菜瓜果',
      vals: [
        "菠菜", "生菜", "油麦菜", "小白菜", "上海青", "娃娃菜", "大白菜", "卷心菜", "西兰花", "菜花",
        "胡萝卜", "白萝卜", "紫甘蓝", "黄瓜", "苦瓜", "冬瓜", "丝瓜", "南瓜", "茄子", "番茄",
        "土豆", "山药", "莲藕", "玉米", "毛豆", "豌豆", "四季豆", "芦笋", "芹菜", "香菜",
        "空心菜", "茼蒿", "韭菜", "香葱", "姜", "蒜", "蘑菇", "杏鲍菇", "金针菇", "平菇"
      ]
    },
    {
      label: '肉禽蛋品',
      vals: [
        "猪里脊", "猪五花", "猪梅花肉", "猪瘦肉", "猪排骨", "牛腱子", "牛腩", "牛里脊", "牛肩肉", "牛排",
        "羊排", "羊腿", "羊蝎子", "羊肉卷", "羊肩肉", "鸡胸肉", "鸡腿", "鸡翅", "整鸡", "鸡里脊",
        "鸭胸肉", "鸭腿", "鸭翅", "整鸭", "鹅肉", "鸡蛋", "鸭蛋", "咸鸭蛋", "鹌鹑蛋", "皮蛋"
      ]
    },
    {
      label: '水产海鲜',
      vals: [
        // 水产菜（海藻类）
        "海带", "紫菜",
        // 淡水鱼
        "鲫鱼", "鲤鱼", "草鱼", "黑鱼", "鲈鱼", "鲢鱼", "白鱼", "鳊鱼", "鲶鱼", "泥鳅", "黄鳝",
        // 海水鱼
        "金枪鱼", "三文鱼", "鳕鱼", "带鱼", "黄花鱼", "鳗鱼", "秋刀鱼",
        // 虾类 / 蟹类 / 贝壳类
        "河虾", "白虾", "青虾", "基围虾", "南美红虾", "北极甜虾", "龙虾", "斑节虾", "大闸蟹", "梭子蟹", "青蟹", "花蟹",
        "扇贝", "生蚝", "蛤蜊", "花甲", "文蛤", "青口贝", "海螺", "鲍鱼", "章鱼", "鱿鱼", "墨鱼", "海参"       
      ]
    },
    {
      label: '豆制其他',
      vals: [
        // 豆制品
        "豆腐", "北豆腐", "南豆腐", "嫩豆腐", "老豆腐", "豆腐干", "豆皮", "腐竹", "豆腐脑", "毛豆",
        // 乳制品
        "牛奶", "酸奶", "奶酪", "黄油", "奶油",
        // 坚果类
        "核桃", "杏仁", "腰果", "花生", "松子"      
      ]
    }
  ]


};