export default {
  primaryColor: '#9cacc3ff',
  primaryColorLight: '#eceff0ff',
  primaryColorDark: '#8e99a7ff',

  foodList: [
    { 
      label: '蔬菜瓜果',
      vals: [
        "菠菜", "生菜", "油麦菜", "青菜", "杭白菜", "娃娃菜", "大白菜", "包菜", "西兰花", "西葫芦",
        "番茄", "土豆", "山药", "莲藕", "玉米", "毛豆", "豌豆", "四季豆", "荷兰豆", "豇豆", 
        "胡萝卜", "白萝卜", "紫甘蓝", "黄瓜", "苦瓜", "冬瓜", "丝瓜", "南瓜", "茭白", "茄子", 
        "芦笋", "芹菜", "香菜", "空心菜", "茼蒿", "韭菜", "黄豆芽", "绿豆芽", "蘑菇", "杏鲍菇", 
        "金针菇", "平菇", "洋葱", "青椒", "辣椒", "柠檬", "菠萝", "芒果", "百香果", "牛油果",
      ]
    },
    {
      label: '肉禽蛋品',
      vals: [
        "猪里脊", "猪五花", "猪梅花肉", "猪瘦肉", "猪排骨", "猪肉沫", "猪肘", "猪肝", "猪腰", "猪大肠", 
        "猪肚", "牛腱子", "牛腩", "牛里脊", "牛肋排", "牛排", "牛肉卷", "牛杂", "羊排", "羊腿", 
        "羊蝎子", "羊肉卷", "羊腱子", "鸡胸肉", "鸡腿", "鸡翅", "整鸡", "鸡里脊", "掌中宝", "鸡爪", 
        "鸡杂", "鸭胸肉", "鸭腿", "鸭翅", "整鸭", "鸭血", "鸭爪", "鸭舌", "鸭杂", "鹅肉", 
        "鸡蛋", "鸭蛋", "咸鸭蛋", "鹌鹑蛋", "皮蛋"
      ]
    },
    {
      label: '水产海鲜',
      vals: [
        // 水产菜（海藻类）
        "海带", "紫菜",
        // 淡水鱼
        "鲫鱼", "草鱼", "黑鱼", "鲈鱼", "鲢鱼",  "鮰鱼", "桂鱼", "白鱼", "鳊鱼", "鲶鱼", "泥鳅", "黄鳝",
        // 海水鱼
        "金枪鱼", "三文鱼", "鳕鱼", "带鱼", "黄花鱼", "鳗鱼", "秋刀鱼",
        // 虾类 / 蟹类 / 贝壳类
        "河虾", "白虾", "青虾", "基围虾", "南美红虾", "北极甜虾", "龙虾", "斑节虾", "大闸蟹", "梭子蟹", "青蟹", "花蟹",
        "扇贝", "生蚝", "蛤蜊", "花甲", "文蛤", "青口贝", "鲍鱼", "章鱼", "鱿鱼", "墨鱼", "八爪鱼", "海参"       
      ]
    },
    {
      label: '豆制其他',
      vals: [
        // 豆制品
        "豆腐", "绢豆腐", "老豆腐", "冻豆腐", "豆腐果", "豆皮", "腐竹", "千张", "干丝", "素鸡", "油面筋", "香干", "鸡蛋干", "凉皮", "魔芋",
        // 乳制品
        "牛奶", "酸奶", "奶酪", "黄油", "奶油",
        // 坚果类
        "核桃", "杏仁", "腰果", "花生", "松子"      
      ]
    }
  ],

  nutriMap: {
    /* --- 宏量营养素 --- */
    "energy_kcal": "能量",  "protein": "蛋白质",      "fat": "脂肪",
    "carbohydrate": "碳水",   "fiber": "膳食纤维",       "cholesterol": "胆固醇",

    /* --- 维生素 --- */
    "v_a": "维生素A",              "v_b1": "维生素B1",         "v_b2": "维生素B2",
    "v_b3": "维生素B3（烟酸）",     "v_b5": "维生素B5（泛酸）",  "v_b6": "维生素B6",

    "v_b7": "维生素B7（生物素）",   "v_b9": "维生素B9（叶酸）",         "v_b12": "维生素B12",
    "v_c": "维生素C",              "v_d": "维生素D",           "v_e": "维生素E",

    "v_k": "维生素K",

    /* --- 矿物质 / 微量元素 --- */
    "Ca": "钙",                   "Fe": "铁",                 "Zn": "锌",
    "Mg": "镁",                   "P": "磷",                  "K": "钾",

    "Na": "钠",                   "Cu": "铜",                 "Mn": "锰",
    "Se": "硒",                   "I": "碘"
  },
  tarotCardBaseUrl: "https://assets.whistlestudio.cn/senior-chef/tarot/",
  tarotList: [
    "愚者", "魔术师", "女祭司", "皇后", "皇帝", "教皇", "恋人", "战车",
    "力量", "隐士", "命运之轮", "正义", "吊人", "死神", "节制",
    "恶魔", "高塔", "星星", "月亮", "太阳", "审判", "世界",

    "权杖Ace","权杖2","权杖3","权杖4","权杖5","权杖6",
    "权杖7","权杖8","权杖9","权杖10",
    "权杖侍从","权杖骑士","权杖皇后","权杖国王",

    "圣杯Ace","圣杯2","圣杯3","圣杯4","圣杯5","圣杯6","圣杯7",
    "圣杯8","圣杯9","圣杯10",
    "圣杯侍从","圣杯骑士","圣杯皇后","圣杯国王",

    "宝剑Ace","宝剑2","宝剑3","宝剑4","宝剑5","宝剑6","宝剑7",
    "宝剑8","宝剑9","宝剑10",
    "宝剑侍从","宝剑骑士","宝剑皇后","宝剑国王",

    "星币Ace","星币2","星币3","星币4","星币5","星币6","星币7",
    "星币8","星币9","星币10",
    "星币侍从","星币骑士","星币皇后","星币国王"
  ]
};